app/controllers/vendors_controller.rb

  def home
    @vendor = Vendor.find(session[:vendor_id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]